In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix


from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
database_path = "/content/drive/My Drive/DBs/logistic_regression/"

In [3]:
database = pd.read_csv(database_path + "Social_Network_Ads.csv")

In [4]:
database.head(5)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
db_dummies = pd.get_dummies(database['Gender'])
db_dummies.head(5)

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1

In [6]:
database = pd.concat([database.drop(['User ID', 'Gender'], axis = 1), db_dummies], axis = 1)

In [7]:
database.head()

   Age  EstimatedSalary  Purchased  Female  Male
0   19            19000          0       0     1
1   35            20000          0       0     1
2   26            43000          0       1     0
3   27            57000          0       1     0
4   19            76000          0       0     1

In [8]:
X = database.drop(['Purchased'], axis = 1)
y = database["Purchased"]

In [9]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 2)

In [10]:
logistic_reg = LogisticRegression(random_state=2)

In [11]:
logistic_reg.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=2, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [12]:
logistic_reg.score(X_test, y_test)

0.6

In [13]:
cm = confusion_matrix(y_test, logistic_reg.predict(X_test))

In [14]:
cm

array([[48,  0],
       [32,  0]])